x1=linspace(8.5,11.5,31)
y1=[-2.6 -2.53 -2.34 -2.16 -1.986 -1.813 -1.643 -1.464 -1.289 -1.107 -0.939 -0.775 -0.594 -0.412 -0.029 -0.030 0.134 0.303 0.497 0.684 0.861 1.037 1.225 1.429 1.620 1.809 1.990 2.19 2.40 2.60 2.80]
plot(x1,y1,'+')
hold on
k1=polyfit(x1,y1,1)
x=linspace(8,12)
y=k1(1)*x+k1(2)
plot(x,y)

grid on
legend('实验数据','拟合数据')
xlabel('位移/(mm)')
ylabel('电压/(V)')

xlim([8.00 12.00])
ylim([-4.00 4.00])
title('V-△X特性曲线')
gtext('拟合曲线方程为：y=1.8116*x-18.12')

[maxy,num]=max(abs(k1(1)*x1+k1(2)-y1))
%求最大非线性偏差(绝对值)，num为误差最大处向量位置
fxxwc=abs(maxy/max(y1))%计算非线性误差



